test/loadtest_index_result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/loadtest_index.spec.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

     █ setup

       ✓ index created

     checks.........................: 100.00% 1 out of 1
     data_received..................: 15 kB   1.4 kB/s
     data_sent......................: 14 kB   1.4 kB/s
     find_foo_duration..............: avg=17.31073 min=3.057  med=17.04   max=27.921  p(90)=24.8408 p(95)=26.1956
     http_req_blocked...............: avg=106µs    min=1µs    med=5µs     max=1.54ms  p(90)=499µs   p(95)=929µs  
     http_req_connecting............: avg=78.07µs  min=0s     med=0s      max=1.03ms  p(90)=256µs   p(95)=751µs  
     http_req_duration..............: avg=17.23ms  min=3.05ms med=17.02ms max=27.92ms p(90)=24.79ms p(95)=26.17ms
       { expected_response:true }...: avg=17.23ms  min=3.05ms med=17.02ms max=27.92ms p(90)=24.79ms p(95)=26.17ms
     http_req_failed................: 0.00%   0 out of 101
     http_req_receiving.............: avg=25.8µs   min=6µs    med=17µs    max=162µs   p(90)=53µs    p(95)=68µs   
     http_req_sending...............: avg=29.04µs  min=2µs    med=11µs    max=358µs   p(90)=76µs    p(95)=100µs  
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s      max=0s      p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=17.17ms  min=3.04ms med=17ms    max=27.8ms  p(90)=24.76ms p(95)=26.15ms
     http_reqs......................: 101     9.897569/s
     iteration_duration.............: avg=1.01s    min=1s     med=1.01s   max=1.03s   p(90)=1.02s   p(95)=1.02s  
     iterations.....................: 100     9.799573/s
     vus............................: 10      min=10       max=10
     vus_max........................: 10      min=10       max=10


running (10.2s), 00/10 VUs, 100 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s