test/loadtest_no_index_result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/loadtest_no_index.spec.ts
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s

     █ setup

       ✓ index created

     checks.........................: 100.00% 1 out of 1
     data_received..................: 3.1 kB  282 B/s
     data_sent......................: 3.0 kB  275 B/s
     find_foo_duration..............: avg=4228.1737 min=3796.742 med=4329.428 max=4785.261 p(90)=4624.4895 p(95)=4747.85475
     http_req_blocked...............: avg=332.9µs   min=3µs      med=469µs    max=1.31ms   p(90)=688µs     p(95)=700µs     
     http_req_connecting............: avg=256.71µs  min=0s       med=231µs    max=666µs    p(90)=568µs     p(95)=585µs     
     http_req_duration..............: avg=4.02s     min=19.96ms  med=4.31s    max=4.78s    p(90)=4.61s     p(95)=4.74s     
       { expected_response:true }...: avg=4.02s     min=19.96ms  med=4.31s    max=4.78s    p(90)=4.61s     p(95)=4.74s     
     http_req_failed................: 0.00%   0 out of 21
     http_req_receiving.............: avg=76.23µs   min=31µs     med=75µs     max=124µs    p(90)=114µs     p(95)=116µs     
     http_req_sending...............: avg=156.04µs  min=8µs      med=18µs     max=2.56ms   p(90)=68µs      p(95)=304µs     
     http_req_tls_handshaking.......: avg=0s        min=0s       med=0s       max=0s       p(90)=0s        p(95)=0s        
     http_req_waiting...............: avg=4.02s     min=19.54ms  med=4.31s    max=4.78s    p(90)=4.61s     p(95)=4.74s     
     http_reqs......................: 21      1.940431/s
     iteration_duration.............: avg=5.23s     min=4.79s    med=5.33s    max=5.78s    p(90)=5.62s     p(95)=5.75s     
     iterations.....................: 20      1.848029/s
     vus............................: 10      min=10      max=10
     vus_max........................: 10      min=10      max=10


running (10.8s), 00/10 VUs, 20 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s